Revit 2024 API
ParameterTypeId.BeamSystem3dParam Property
 "3D"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BeamSystem3dParam { get; }
Visual Basic
Public Shared ReadOnly Property BeamSystem3dParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BeamSystem3dParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace